<a href="https://colab.research.google.com/github/Alakay-cloud/Moringa_Data_Science_Prep_W3_Independent_Project_2020_03_Alex_Mburu/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2020_03_Alex_Mburu_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#importing our dictionaries
import pandas as pd
import numpy as np

In [0]:
#load the telkom_dataset
df = pd.read_csv("Telcom_dataset.csv")
df.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [0]:
#we note the prescence of errors in the columns
#we clean the dataset by correcting the columns in the telcom_dataset
df.rename(columns = {'PRODUTC':'PRODUCT','DATETIME':'DATE_TIME','DW_A_NUMBER_INT':'DW_A_NUMBER','DW_B_NUMBER_INT':'DW_B_NUMBER'}, inplace = True)
df.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [0]:
# describing the  telcom_dataset
df.describe()

             VALUE
count  5001.000000
mean     25.869626
std     101.934502
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    4440.000000

In [0]:
# load the telkom_dataset2
df2 = pd.read_csv("Telcom_dataset2.csv")
df2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [0]:
# since there are no errors in telcom_dataset2
# describe it directly
df2.describe()

             VALUE
count  5001.000000
mean     24.334933
std      97.471586
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    3380.000000

In [0]:
#load the telkom_dataset3
df3 = pd.read_csv("Telcom_dataset3.csv")
df3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [0]:
#we clean the dataset by correcting the columns in the telcom_dataset3
df3.rename(columns={'DW_A_NUMBER_INT':'DW_A_NUMBER','DW_B_NUMBER_INT':'DW_B_NUMBER','CELLID':'CELL_ID','SIET_ID':'SITE_ID'},inplace = True)
df3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [0]:
# describe the telcom_dataset3
df3.describe()

              VALUE
count   5001.000000
mean      26.441512
std      224.200217
min        0.000000
25%        0.000000
50%        0.000000
75%       25.000000
max    12900.000000

In [0]:

#read the CDR_description.xlsx
cdr_read = pd.read_excel('/content/CDR_description.xlsx', header = 1, sheet_name = 0)
cdr_read

           PRODUCT                                       Voice or SMS   String
0            VALUE                                      Billing price  Integer
1        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
2     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
3  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
4  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
5        COUNTRY_A                  Country of party A (useless here)   String
6        COUNTRY_B                  Country of party B (useless here)   String
7          CELL_ID                                     ID of the cell   String
8          SITE_ID                                     ID of the SITE   String

In [0]:
#read the cells_geo_description.xlsx
geo_read = pd.read_excel('/content/cells_geo_description.xlsx', header = 0, sheet_name = 0)
geo_read

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [0]:
#read the cells_geo file 
#rename the columns so as to make sure they are similar in names to prevent errors later
cells_geo = pd.read_csv('/content/cells_geo.csv', sep='[;]' , engine= 'python')
cells_geo.rename(columns = {'SITE_CODE' : 'SITE_ID'}, inplace = True)
cells_geo.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID     SITE_ID
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

ANALYSIS
1. CALCULATIONS

In [0]:

#we are going to calculating average usage of voice calls in the three data sets
df[df['PRODUCT']== 'Voice'].VALUE.mean()

49.06219017575484

In [0]:
df2[df2['PRODUCT'] == 'Voice'].VALUE.mean()

54.29485834207765

In [0]:
df3[df3['PRODUCT'] == 'Voice'].VALUE.mean()

65.04737183646982

In [0]:
#sms
df[df['PRODUCT']== 'sms'].VALUE.mean()

6.821772151898734

ERROR! Session/line number was not unique in database. History logging moved to new session 60

In [0]:
df2[df2['PRODUCT'] == 'sms'].VALUE.mean()

5.458565908115071

In [0]:
df3[df3['PRODUCT'] == 'sms'].VALUE.mean()

9.84495843874232

  2.WORKING THROUGH COLUMNS

In [0]:
#we are selecting the columns that we are going to use
df_t = df[['PRODUCT','VALUE','DATE_TIME','CELL_ID']]
df_t

     PRODUCT  VALUE              DATE_TIME     CELL_ID
0      Voice      0  2012-05-06 23:04:37.0  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  051KhYDCpv
...      ...    ...                    ...         ...
4996     sms    100  2012-05-07 00:01:54.0  0c2371d9bc
4997   Voice      1  2012-05-07 00:01:54.0  5fb791cf56
4998   Voice      0  2012-05-07 00:01:54.0  7773627c12
4999   Voice      0  2012-05-07 00:01:54.0  3f4af49d6c
5000   Voice      7  2012-05-07 00:01:54.0  6f4d9b77a5

[5001 rows x 4 columns]

In [0]:
#we are getting the total number of sms from the Telcom_dataset
df_t[df_t['PRODUCT'] == 'sms'].count()

PRODUCT      1975
VALUE        1975
DATE_TIME    1975
CELL_ID      1975
dtype: int64

In [0]:
#we are getting the total number of voice calls from the Telcom_dataset
df_t[df['PRODUCT'] == 'Voice'].count()

PRODUCT      2219
VALUE        2219
DATE_TIME    2219
CELL_ID      2219
dtype: int64

In [0]:
#we are selecting the columns that we are going to use in the Telcom_dataset2
df2_t = df2[['PRODUCT','VALUE','DATE_TIME','CELL_ID']]
df2_t

     PRODUCT  VALUE              DATE_TIME     CELL_ID
0        sms      0  2012-05-07 23:02:06.0  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  +bO+qkSonO
...      ...    ...                    ...         ...
4996     sms      0  2012-05-08 00:01:53.0  896459aace
4997     sms     25  2012-05-08 00:01:53.0  7e90b35166
4998     sms      0  2012-05-08 00:01:53.0  fe70e431df
4999    data      0  2012-05-08 00:01:53.0  ffa6759bb2
5000   Voice      0  2012-05-08 00:01:53.0  8630058aca

[5001 rows x 4 columns]

In [0]:
#we are getting the total number of sms from the Telcom_dataset2
df2_t[df2['PRODUCT'] == 'sms'].count()

PRODUCT      2329
VALUE        2329
DATE_TIME    2329
CELL_ID      2329
dtype: int64

In [0]:
#we are getting the total number of voice calls from the Telcom_dataset2
df2_t[df2['PRODUCT'] == 'Voice'].count()

PRODUCT      1906
VALUE        1906
DATE_TIME    1906
CELL_ID      1906
dtype: int64

In [0]:
# we are picking the columns that we are going to use in the Telcom_dataset3
df3_t = df3[["PRODUCT","VALUE","DATE_TIME", "CELL_ID"]]
df3_t

     PRODUCT  VALUE              DATE_TIME     CELL_ID
0      Voice     61  2012-05-08 23:01:28.0  +38u2u/rfx
1        sms      0  2012-05-08 23:01:31.0  +Fs4mTvdKx
2      Voice     10  2012-05-08 23:02:59.0  +ZaaZozy/+
3        sms      0  2012-05-08 23:03:04.0  +cNeJzsTp3
4      Voice     22  2012-05-08 23:03:16.0  /eeMklgyJA
...      ...    ...                    ...         ...
4996   Voice      0  2012-05-09 00:01:43.0  2aa04dcab7
4997   Voice     62  2012-05-09 00:01:43.0  7f1f2f889f
4998   Voice     32  2012-05-09 00:01:43.0  a4731e780e
4999   Voice     30  2012-05-09 00:01:43.0  98ed726da2
5000   Voice     60  2012-05-09 00:01:43.0  1c11a2fcbb

[5001 rows x 4 columns]

In [0]:
#we are getting the total number of sms from the Telcom_dataset3
df3_t[df3_t['PRODUCT'] == "sms"].count()

PRODUCT      2767
VALUE        2767
DATE_TIME    2767
CELL_ID      2767
dtype: int64

In [0]:
#we are getting the total number of voice calls from the Telcom_dataset3
df3_t[df3_t['PRODUCT'] == "Voice"].count()

PRODUCT      1541
VALUE        1541
DATE_TIME    1541
CELL_ID      1541
dtype: int64

In [0]:
#we are getting the most used infrastructure from the Telcom_dataset
df_t[df_t['PRODUCT'] == 'Voice'].CELL_ID.max()

'ffcc507579'

In [0]:
df_t[df_t['PRODUCT'] == 'sms'].CELL_ID.max()

'ffcc507579'

In [0]:
#we are getting the most used infrastructure from the Telcom_dataset2
df2_t[df2_t['PRODUCT'] == 'Voice'].CELL_ID.max()

'ffb86d66d2'

In [0]:
df2_t[df2_t['PRODUCT'] == 'sms'].CELL_ID.max()

'ffcc507579'

In [0]:
#we are getting the most used infrastructure from the Telcom_dataset3
df3_t[df3_t['PRODUCT'] == 'Voice'].CELL_ID.max()

'fed537f3b2'

In [0]:
df3_t[df3_t['PRODUCT'] == 'sms'].CELL_ID.max()

'ff99709d62'

In [0]:
#we are counting the status which equals the in service in the cells_geo dataset
cells_geo[cells_geo['STATUS'] == "In Service"].count()

Unnamed: 0      3907
VILLES          3907
STATUS          3907
LOCALISATION    3907
DECOUPZONE      3907
ZONENAME        3901
LONGITUDE       3907
LATITUDE        3907
REGION          3907
AREA            3886
CELL_ID         3907
SITE_ID         3907
dtype: int64

In [0]:
#we are spliting the above counted columns
cells_geo.columns.str.split(';').str[0].tolist()
['VILLES','STATUS','LOCALISATION','DECOUPZONE','ZONENAME','LONGITUDE','LATITUDE','REGION','AREA','CELL_ID','SITE_CODE']

['VILLES',
 'STATUS',
 'LOCALISATION',
 'DECOUPZONE',
 'ZONENAME',
 'LONGITUDE',
 'LATITUDE',
 'REGION',
 'AREA',
 'CELL_ID',
 'SITE_CODE']

3.MERGING THE DATASETS

In [0]:
#we are merging the three data sets
df_merged = pd.concat([df,df2,df3])
df_merged.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [0]:
df2_merged = pd.merge(df_merged, cells_geo, on = ('CELL_ID','SITE_ID'), how = 'outer')
df2_merged.head()

  PRODUCT  VALUE              DATE_TIME  ... LATITUDE REGION AREA
0   Voice    0.0  2012-05-06 23:04:37.0  ...      NaN    NaN  NaN
1     sms    0.0  2012-05-06 23:40:48.0  ...      NaN    NaN  NaN
2     sms    0.0  2012-05-07 23:32:47.0  ...      NaN    NaN  NaN
3     sms    0.0  2012-05-07 23:52:21.0  ...      NaN    NaN  NaN
4    data    0.0  2012-05-07 23:53:21.0  ...      NaN    NaN  NaN

[5 rows x 20 columns]

In [0]:
#we will check for duplicate values
#we will check for missing values
#we will drop columns
#we are going to drop records with missing values
#we we are going to records with any missing values
df2_merged.drop_duplicates()
df2_merged.isna()
df2_merged.drop(['Unnamed: 0', 'VILLES','STATUS','LOCALISATION','DECOUPZONE','ZONENAME','LONGITUDE','LATITUDE','REGION','AREA','COUNTRY_A','COUNTRY_B'], axis= 1)
df_droped = df2_merged.dropna(how = 'any')
df_droped

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, CELL_ON_SITE, DW_A_NUMBER, DW_B_NUMBER, COUNTRY_A, COUNTRY_B, CELL_ID, SITE_ID, Unnamed: 0, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, LONGITUDE, LATITUDE, REGION, AREA]
Index: []

In [0]:
#we are confirming that all null records have been dropped
df_droped.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 20 columns):
PRODUCT         0 non-null object
VALUE           0 non-null float64
DATE_TIME       0 non-null object
CELL_ON_SITE    0 non-null object
DW_A_NUMBER     0 non-null object
DW_B_NUMBER     0 non-null object
COUNTRY_A       0 non-null object
COUNTRY_B       0 non-null object
CELL_ID         0 non-null object
SITE_ID         0 non-null object
Unnamed: 0      0 non-null float64
VILLES          0 non-null object
STATUS          0 non-null object
LOCALISATION    0 non-null object
DECOUPZONE      0 non-null object
ZONENAME        0 non-null object
LONGITUDE       0 non-null float64
LATITUDE        0 non-null float64
REGION          0 non-null object
AREA            0 non-null object
dtypes: float64(4), object(16)
memory usage: 0.0+ bytes

In [0]:
#we are grouping our values by product then finding the mean
df2_merged['VALUE'].groupby(df2_merged['PRODUCT']).mean()

PRODUCT
Voice    55.169961
data      7.628861
sms       7.555791
Name: VALUE, dtype: float64

In [0]:
#we are going to split the DATE_TIME to new columns of DATE and TIME
df2_merged[['DATE', 'TIME']] = df2_merged.DATE_TIME.str.split(expand = True)
df2_merged.head()

  PRODUCT  VALUE              DATE_TIME  ... AREA        DATE        TIME
0   Voice    0.0  2012-05-06 23:04:37.0  ...  NaN  2012-05-06  23:04:37.0
1     sms    0.0  2012-05-06 23:40:48.0  ...  NaN  2012-05-06  23:40:48.0
2     sms    0.0  2012-05-07 23:32:47.0  ...  NaN  2012-05-07  23:32:47.0
3     sms    0.0  2012-05-07 23:52:21.0  ...  NaN  2012-05-07  23:52:21.0
4    data    0.0  2012-05-07 23:53:21.0  ...  NaN  2012-05-07  23:53:21.0

[5 rows x 22 columns]

In [0]:
#we are going to select the product, value, time, cell_id and villes from the merged datat set
df_droped = df2_merged[['PRODUCT','VALUE','TIME','CELL_ID', 'VILLES']]
df_droped

      PRODUCT  VALUE        TIME     CELL_ID    VILLES
0       Voice    0.0  23:04:37.0  /TJNe+Mmtu       NaN
1         sms    0.0  23:40:48.0  /TJNe+Mmtu       NaN
2         sms    0.0  23:32:47.0  /TJNe+Mmtu       NaN
3         sms    0.0  23:52:21.0  /TJNe+Mmtu       NaN
4        data    0.0  23:53:21.0  /TJNe+Mmtu       NaN
...       ...    ...         ...         ...       ...
18972     NaN    NaN         NaN  1cfc2d7ab1  ZUENOULA
18973     NaN    NaN         NaN  3ae1708153  ZUENOULA
18974     NaN    NaN         NaN  cb71f8a29c  ZUENOULA
18975     NaN    NaN         NaN  d4a6a0b645  ZUENOULA
18976     NaN    NaN         NaN  f9f3e42589  ZUENOULA

[18977 rows x 5 columns]

In [0]:
# finding the means
df_droped.describe()

              VALUE
count  15003.000000
mean      25.548690
std      152.916219
min        0.000000
25%        0.000000
50%        0.000000
75%       25.000000
max    12900.000000

In [0]:
#we are going to determine the cells that genearte the highest revenue according to the data given
#they are thought of bringing in more revenue hence are more profitable
#we can restrict ourselves to the first 5 ithat are the highest in giving out profit 
df_compl = df2_merged.groupby('CELL_ID')['VALUE'].sum()
df_compl

CELL_ID
++ctND+jGD    134.0
+38u2u/rfx    247.0
+854AcBQT2    154.0
+Fs4mTvdKx     31.0
+QZ9qRtNxA     55.0
              ...
ffa73de35f      0.0
ffb2bc893e      0.0
ffb86d66d2    110.0
ffc4c8c1b2      0.0
ffcc507579     91.0
Name: VALUE, Length: 6593, dtype: float64

In [0]:
#we are going to sort them from the one with the highest profit
df_compl.sort_values(ascending = False).iloc[:5]

CELL_ID
ffa6759bb2    15286.0
2def69183e    12900.0
3f5ac97214     6850.0
MpOhP3OKNN     4225.0
5a7f6cf0fa     3437.0
Name: VALUE, dtype: float64